<!--  -->
<template>
  <div>
      <swiper class="swiper" :options="swiperOption">
          <swiper-slide class="text">
              10月16日，2015减贫与发展高层论坛在北京人民大会堂举行。国家主席习近平出席论坛并发表题为《携手消除贫困促进共同发展》的主旨演讲。 新华社记者李涛摄

　　中国青年网北京12月28日电 (见习记者 开可 记者 杜美辰) 自2012年11月，习近平总书记在国家博物馆参观“复兴之路”展览时首提“中国梦”至今，“中国梦”这个词已走过了三个年头。2015年，习近平在减贫与发展高层论坛上发表主旨演讲并强调：“全面建成小康社会，实现中国梦，就是要实现人民幸福。”实现中国梦离不开中国人民过上幸福的生活，中国青年网记者发现，民生一直是习总书记的牵挂，诚如他说过的，“把增进人民福祉、促进人的全面发展作为发展的出发点和落脚点”。而在实现中国梦的过程中，广大青年群体则用实际行动进行响应。

　　民生问题是习大大最大牵挂

　　2015年，“民生”成为习近平的关键词之一。在众多会议和考察调研中，习近平多次强调民生问题，体现了他心系人民的情怀。

　　1月，在十八届中央政治局第二十次集体学习时，习近平指出，全面深化改革要突出改革的系统性、整体性、协同性，使改革成果更多更公平惠及全体人民。

　　5月，在华东7省市党委主要负责同志座谈会上，习总书记提出要坚持经济发展以保障和改善民生为出发点和落脚点，全面解决好人民群众关心的教育、就业、收入、社保、医疗卫生、食品安全等问题，让改革发展成果更多、更公平、更实在地惠及广大人民群众。10月16日，2015减贫与发展高层论坛在北京人民大会堂举行。国家主席习近平出席论坛并发表题为《携手消除贫困促进共同发展》的主旨演讲。 新华社记者李涛摄

　　中国青年网北京12月28日电 (见习记者 开可 记者 杜美辰) 自2012年11月，习近平总书记在国家博物馆参观“复兴之路”展览时首提“中国梦”至今，“中国梦”这个词已走过了三个年头。2015年，习近平在减贫与发展高层论坛上发表主旨演讲并强调：“全面建成小康社会，实现中国梦，就是要实现人民幸福。”实现中国梦离不开中国人民过上幸福的生活，中国青年网记者发现，民生一直是习总书记的牵挂，诚如他说过的，“把增进人民福祉、促进人的全面发展作为发展的出发点和落脚点”。而在实现中国梦的过程中，广大青年群体则用实际行动进行响应。

　　民生问题是习大大最大牵挂

　　2015年，“民生”成为习近平的关键词之一。在众多会议和考察调研中，习近平多次强调民生问题，体现了他心系人民的情怀。

　　1月，在十八届中央政治局第二十次集体学习时，习近平指出，全面深化改革要突出改革的系统性、整体性、协同性，使改革成果更多更公平惠及全体人民。

　　5月，在华东7省市党委主要负责同志座谈会上，习总书记提出要坚持经济发展以保障和改善民生为出发点和落脚点，全面解决好人民群众关心的教育、就业、收入、社保、医疗卫生、食品安全等问题，让改革发展成果更多、更公平、更实在地惠及广大人民群众。10月16日，2015减贫与发展高层论坛在北京人民大会堂举行。国家主席习近平出席论坛并发表题为《携手消除贫困促进共同发展》的主旨演讲。 新华社记者李涛摄

　　中国青年网北京12月28日电 (见习记者 开可 记者 杜美辰) 自2012年11月，习近平总书记在国家博物馆参观“复兴之路”展览时首提“中国梦”至今，“中国梦”这个词已走过了三个年头。2015年，习近平在减贫与发展高层论坛上发表主旨演讲并强调：“全面建成小康社会，实现中国梦，就是要实现人民幸福。”实现中国梦离不开中国人民过上幸福的生活，中国青年网记者发现，民生一直是习总书记的牵挂，诚如他说过的，“把增进人民福祉、促进人的全面发展作为发展的出发点和落脚点”。而在实现中国梦的过程中，广大青年群体则用实际行动进行响应。

　　民生问题是习大大最大牵挂

　　2015年，“民生”成为习近平的关键词之一。在众多会议和考察调研中，习近平多次强调民生问题，体现了他心系人民的情怀。

　　1月，在十八届中央政治局第二十次集体学习时，习近平指出，全面深化改革要突出改革的系统性、整体性、协同性，使改革成果更多更公平惠及全体人民。

　　5月，在华东7省市党委主要负责同志座谈会上，习总书记提出要坚持经济发展以保障和改善民生为出发点和落脚点，全面解决好人民群众关心的教育、就业、收入、社保、医疗卫生、食品安全等问题，让改革发展成果更多、更公平、更实在地惠及广大人民群众。
          </swiper-slide>
      </swiper>
  </div>
</template>

<script>
import 'swiper/dist/css/swiper.css'
import { swiper, swiperSlide } from 'vue-awesome-swiper'
export default {
  props: [],

  data () {
    return {
        swiperOption: {
            direction: 'vertical',
            slidesPerView: 'auto',      // 一屏当中有多少个swiperSlide
            freeMode: true,     // 是否自动贴合，默认为false每次滑动一格贴合
            mousewheel: true   //pc 端滚轮效果
        }
    };
  },

  created(){},

  mounted(){},

  watch: {},

  computed: {},

  methods: {},

  components: {swiper, swiperSlide}
}

</script>
<style lang='scss' scoped>
.swiper{
    height: 300px;
    overflow: hidden;
    .text{
        font-size: 18px;
        text-align: left;
        padding: 30px;
        height: auto;
        box-sizing: border-box;
    }
}
</style>